//app /components /kids-magazine /Contents.tsx

export default function Contents() {
  return (
    <div className="max-w-[964px] m-auto border-t border-t-[#e6e6e6] py-[88px] text-justify max-sm:py-[78px]">
      <p className="leading-[32px] max-sm:text-[14px] max-sm:leading-[26px]">
        계간 『창비어린이』는 2003년 창간된 아동청소년문학 전문 비평지로, 매호
        국내 동시, 동화, 청소년소설 장르의 우수작을 엄선하여 게재함으로써
        창작자에게 지속적인 활동 지면을 보장하고 창작 에너지를 북돋고 있습니다.
        또 아동청소년문학의 현주소를 정밀하게 진단하고 미래지향적 전망을
        모색하는 비평의 장을 마련하는 한편, 외국의 주요 비평이론을 소개하여 우리
        아동청소년문학의 수준을 한 단계 높이는 데 기여하고 있습니다. 이를 통해
        독자에게 수준 높은 아동청소년문학 향유의 기회를 제공함으로써 한국
        아동청소년문학 발전의 토대로서 기능함을 목적으로 합니다.
        <br />
        <br />
        계간 『창비어린이』는 한국 아동문학의 도전, 개척, 논쟁을 이끌어 내는 데
        앞장서고자 노력 중입니다. 한국 아동문학의 근대성에 대한 성찰, 현대 외국
        아동문학의 성과에 대한 점검, 번역·인터뷰·대담 형식을 통한 외국
        아동문학과의 직접적인 교류 등을 지면 기획의 바탕으로 삼고 있습니다. 또
        매년 1회, 창간 기념 세미나를 개최하여 한국 아동문학의 근대성을
        비판적으로 검토하고 현대성의 과제를 제기하며 뜨거운 현장토론을 이끌어
        내고 있습니다.
        <br />
        <br />
        계간 『창비어린이』는 어린이문화에 관한 지속적인 관심을 통해 어린이와
        시대의 소통을 돕는 데 노력을 기울이고 있습니다. 하루가 다르게 변화를
        거듭하는 시대와 어린이가 교차하는 지점―학교, 도서관, 학원, 텔레비전,
        인터넷, 영화, 출판 등―모든 영역에서 진지한 담론을 형성하기 위해 노력하고
        있습니다.
      </p>
    </div>
  );
}
